{
  "metadata": {
    "id": "11",
    "encounter_type": "well-child",
    "patient_age": "2 weeks",
    "patient_name": "Baby Lucas",
    "chief_complaint": "newborn check, detailed family history including maternal depression",
    "targets": ["family_history", "sensitive_content", "feeding_assessment"],
    "duration_tier": "long"
  },
  "speakers": {
    "doctor": {"voice": "female-1", "style": "gentle, supportive"},
    "parent": {"voice": "female-2", "style": "tired new mom, vulnerable"}
  },
  "script": [
    {"speaker": "doctor", "text": "Hi Mom, congratulations! Let me see this handsome boy. How's everyone doing at home?", "direction": "warm, celebratory"},
    {"speaker": "parent", "text": "Thank you. We're... surviving. It's been harder than I expected honestly.", "direction": "tired, honest"},
    {"speaker": "doctor", "text": "That's completely normal to feel that way. The first few weeks are intense. Tell me about how Lucas is eating.", "direction": "validating, assessing"},
    {"speaker": "parent", "text": "I'm breastfeeding, or trying to. It's been really hard. He wants to eat constantly but I don't know if he's getting enough.", "direction": "struggling"},
    {"speaker": "doctor", "text": "How often is he nursing?", "direction": "gathering details"},
    {"speaker": "parent", "text": "Every one to two hours during the day. A little longer at night, maybe three hour stretches.", "direction": "describing"},
    {"speaker": "doctor", "text": "And how many wet and dirty diapers?", "direction": "output assessment"},
    {"speaker": "parent", "text": "Wet, probably six to eight a day. Poops are yellow now, usually three or four a day.", "direction": "good signs"},
    {"speaker": "doctor", "text": "That's actually really reassuring. Those are exactly the numbers we want to see. Let me check his weight.", "direction": "positive feedback"},
    {"speaker": "doctor", "text": "He's eight pounds two ounces. What was his birth weight and discharge weight?", "direction": "growth assessment"},
    {"speaker": "parent", "text": "He was seven pounds eight ounces at birth, and seven four when we left the hospital.", "direction": "providing data"},
    {"speaker": "doctor", "text": "So he's gained ten ounces above his discharge weight. That's excellent. He's gaining beautifully on breast milk alone.", "direction": "reassuring"},
    {"speaker": "parent", "text": "Really? I was so worried I wasn't making enough.", "direction": "relieved"},
    {"speaker": "doctor", "text": "His weight tells us he's getting plenty. You're doing a great job.", "direction": "supportive"},
    {"speaker": "doctor", "text": "I want to ask about family history. Any health conditions on either side of the family I should know about?", "direction": "transitioning"},
    {"speaker": "parent", "text": "Let me think. My mom has diabetes, type 2. My dad had a heart attack in his sixties. Um, my husband's dad has high cholesterol.", "direction": "thinking"},
    {"speaker": "doctor", "text": "Any childhood illnesses or developmental concerns in the family?", "direction": "probing"},
    {"speaker": "parent", "text": "No, I don't think so. Everyone was healthy as kids.", "direction": "answering"},
    {"speaker": "doctor", "text": "Any history of depression or anxiety in the family?", "direction": "mental health history"},
    {"speaker": "parent", "text": "Um, yes actually. I had depression in college, before I met my husband. And my sister has anxiety. Why do you ask?", "direction": "opening up"},
    {"speaker": "doctor", "text": "I ask everyone, but especially because having a history of depression is a risk factor for postpartum depression. How are you feeling emotionally?", "direction": "screening"},
    {"speaker": "parent", "text": "Honestly? Not great. I cry a lot. I feel like I don't know what I'm doing. Sometimes I just feel so overwhelmed I want to run away.", "direction": "vulnerable, honest"},
    {"speaker": "doctor", "text": "Thank you for being honest with me. What you're describing is really common, and it sounds like more than just the baby blues. Have you had any thoughts of hurting yourself or the baby?", "direction": "safety assessment, compassionate"},
    {"speaker": "parent", "text": "No, nothing like that. I love him so much. I just feel like I'm failing at this.", "direction": "clarifying, emotional"},
    {"speaker": "doctor", "text": "You are absolutely not failing. What you're describing sounds like postpartum depression, and it's treatable. It doesn't mean you're a bad mom. It means you need some support.", "direction": "normalizing, encouraging"},
    {"speaker": "parent", "text": "I didn't want to say anything because I felt ashamed.", "direction": "admitting"},
    {"speaker": "doctor", "text": "There's no shame in this. Your brain chemistry is going through huge shifts right now. Would you be open to talking to someone about how you're feeling?", "direction": "offering help"},
    {"speaker": "parent", "text": "Yes. I think I need to.", "direction": "accepting"},
    {"speaker": "doctor", "text": "Good. I'm going to give you a referral to a therapist who specializes in perinatal mental health. And I want you to follow up with your OB this week to talk about whether medication might help. Are you okay with that?", "direction": "concrete plan"},
    {"speaker": "parent", "text": "Yes. My husband has been worried about me too. He'll be relieved I'm getting help.", "direction": "supportive partner"},
    {"speaker": "doctor", "text": "I'm glad you have support at home. Let's examine Lucas now.", "direction": "transitioning"},
    {"speaker": "doctor", "text": "He looks great. Good tone, good color. Fontanelle is soft and flat. Heart sounds normal. Hips are stable. Umbilical stump is clean and dry.", "direction": "examining"},
    {"speaker": "doctor", "text": "He's a healthy two week old. No concerns from my exam. He doesn't need any vaccines today, we'll start those at two months.", "direction": "summary"},
    {"speaker": "parent", "text": "When do I bring him back?", "direction": "asking"},
    {"speaker": "doctor", "text": "I'd like to see him at one month, and I want to check in on how you're doing too. Call me if anything comes up before then, with him or with you.", "direction": "follow up, including mom"},
    {"speaker": "parent", "text": "Thank you. For everything. For asking about me.", "direction": "grateful"},
    {"speaker": "doctor", "text": "Of course. Taking care of you is part of taking care of him.", "direction": "closing, supportive"}
  ]
}
